{
  "tasks": [
    {
      "task_title": "Check a single username across social networks",
      "task_description": "This task checks the availability of a single username 'user123' across various social networks.",
      "example_code": null,
      "running_command": "sherlock user123",
      "expected_input": "user123",
      "expected_output": "[{ 'username': 'user123', 'links': [...] }]"
    },
    {
      "task_title": "Check multiple usernames across social networks",
      "task_description": "This task checks the availability of multiple usernames 'user1', 'user2', and 'user3' across various social networks.",
      "example_code": null,
      "running_command": "sherlock user1 user2 user3",
      "expected_input": "user1 user2 user3",
      "expected_output": "[{ 'username': 'user1', 'links': [...] }, { 'username': 'user2', 'links': [...] }, { 'username': 'user3', 'links': [...] }]"
    },
    {
      "task_title": "Display help information",
      "task_description": "This task displays the help information for the Sherlock CLI tool, including usage and available options.",
      "example_code": null,
      "running_command": "sherlock --help",
      "expected_input": null,
      "expected_output": "usage: sherlock [-h] [--version] [--verbose] ..."
    },
    {
      "task_title": "Call Sherlock with JSON input",
      "task_description": "This task demonstrates how to call the Sherlock tool with a JSON input containing usernames.",
      "example_code": null,
      "running_command": "echo '{\"usernames\":[\"user123\"]}' | apify call -so netmilk/sherlock",
      "expected_input": "{\"usernames\":[\"user123\"]}",
      "expected_output": "[{ \"username\": \"user123\", \"links\": [...] }]"
    }
  ],
  "setup": {
    "setup_commands": [],
    "docker_commands": [],
    "docker_files": {
      "Dockerfile": "# Release instructions:\n  # 1. Update the version tag in the Dockerfile to match the version in sherlock/__init__.py\n  # 2. Update the VCS_REF tag to match the tagged version's FULL commit hash\n  # 3. Build image with BOTH latest and version tags\n    # i.e. `docker build -t sherlock/sherlock:0.16.0 -t sherlock/sherlock:latest .`\n\nFROM python:3.12-slim-bullseye AS build\nWORKDIR /sherlock\n\nRUN pip3 install --no-cache-dir --upgrade pip\n\nFROM python:3.12-slim-bullseye\nWORKDIR /sherlock\n\nARG VCS_REF= # CHANGE ME ON UPDATE\nARG VCS_URL=\"https://github.com/sherlock-project/sherlock\"\nARG VERSION_TAG= # CHANGE ME ON UPDATE\n\nENV SHERLOCK_ENV=docker\n\nLABEL org.label-schema.vcs-ref=$VCS_REF \\\n      org.label-schema.vcs-url=$VCS_URL \\\n      org.label-schema.name=\"Sherlock\" \\\n      org.label-schema.version=$VERSION_TAG \\\n      website=\"https://sherlockproject.xyz\"\n\nRUN pip3 install --no-cache-dir sherlock-project==$VERSION_TAG\n\nWORKDIR /sherlock\n\nENTRYPOINT [\"sherlock\"]\n",
      ".dockerignore": ".git/\n.vscode/\nscreenshot/\ntests/\n*.txt\n!/requirements.txt\nvenv/\ndevel/"
    },
    "docker_setup_descriptions": {
      "Dockerfile": "To build and run the Docker image for the Sherlock project, follow these steps:\n\n### Building the Docker Image\n\n1. **Update Version Information**: Before building the image, ensure you update the version tag in the Dockerfile to match the version specified in the `sherlock/__init__.py` file. This ensures that the Docker image corresponds to the correct version of the application.\n\n2. **Set VCS Reference**: Update the `VCS_REF` argument in the Dockerfile to reflect the full commit hash of the tagged version you are building. This is important for tracking the specific state of the codebase used in the image.\n\n3. **Build the Image**: Use Docker to build the image. The build process will create a lightweight image based on the Python 3.12 slim variant. The image installs the necessary dependencies, including the Sherlock project itself, using the specified version tag. The command will tag the image with both the specific version and the latest tag for easy reference.\n\n### Purpose of the Image\n\nThe resulting Docker image is designed to run the Sherlock application, which is a tool for hunting down social media accounts by username. It encapsulates all necessary dependencies, ensuring a consistent environment for running the application.\n\n### Dependencies\n\nThe image relies on the Python 3.12 slim-bullseye base image, which provides a minimal environment to run Python applications. The primary dependency installed is the Sherlock project itself, specified by the version tag you set during the build process. This ensures that the application has all required libraries and dependencies to function correctly.\n\n### Running the Docker Container\n\nOnce the image is built, you can run it using Docker. The entry point is set to the Sherlock command, allowing you to execute the application directly. You may need to provide additional parameters or configurations depending on your specific use case.\n\nBy following these steps, you will have a fully functional Docker image for the Sherlock project, ready for deployment or local testing.",
      ".dockerignore": "To build and run a Docker image for the Sherlock project, follow these steps:\n\n### Purpose of the Docker Image\nThe Docker image for the Sherlock project is designed to encapsulate the application and its dependencies, allowing for a consistent and isolated environment for running the Sherlock tool. This tool is used for identifying usernames across various social media platforms, making it useful for security researchers and developers.\n\n### Dependencies\nThe image includes essential dependencies specified in the `requirements.txt` file, which is the only text file retained in the build context due to the `.dockerignore` configuration. This ensures that only the necessary components are included in the image, while excluding unnecessary files and directories such as version control files, development environments, and test directories.\n\n### Building Steps\n1. **Clone the Repository**: Start by cloning the `sherlock-project/sherlock` repository to your local machine.\n   \n2. **Navigate to the Project Directory**: Change your working directory to the root of the cloned repository.\n\n3. **Build the Docker Image**: Use the Docker build command to create the image. The build process will utilize the Dockerfile in the repository, which sets up the environment by installing Python and the required libraries listed in `requirements.txt`. The `.dockerignore` file will ensure that unnecessary files are excluded from the build context, optimizing the image size and build time.\n\n4. **Tag the Image**: Optionally, tag the image with a meaningful name for easier reference later.\n\n### Running the Docker Container\nOnce the image is built, you can run a container from it. The container will execute the Sherlock application, allowing you to use it for username searches across various platforms. You may need to pass specific arguments or configurations depending on your use case.\n\n### Summary\nBy following these steps, you will have a Docker image that encapsulates the Sherlock application and its dependencies, ready for use in a controlled environment. This setup enhances portability and ensures that the application runs consistently across different systems."
    }
  },
  "input_to_gpt": {
    "repo_name": "sherlock-project/sherlock",
    "num_code_blocks": 4,
    "total_length": 2866,
    "code_blocks": [
      "sherlock user123",
      "sherlock user1 user2 user3",
      "$ sherlock --help\nusage: sherlock [-h] [--version] [--verbose] [--folderoutput FOLDEROUTPUT]\n                [--output OUTPUT] [--tor] [--unique-tor] [--csv] [--xlsx]\n                [--site SITE_NAME] [--proxy PROXY_URL] [--json JSON_FILE]\n                [--timeout TIMEOUT] [--print-all] [--print-found] [--no-color]\n                [--browse] [--local] [--nsfw]\n                USERNAMES [USERNAMES ...]\n\nSherlock: Find Usernames Across Social Networks (Version 0.14.3)\n\npositional arguments:\n  USERNAMES             One or more usernames to check with social networks.\n                        Check similar usernames using {?} (replace to '_', '-', '.').\n\noptional arguments:\n  -h, --help            show this help message and exit\n  --version             Display version information and dependencies.\n  --verbose, -v, -d, --debug\n                        Display extra debugging information and metrics.\n  --folderoutput FOLDEROUTPUT, -fo FOLDEROUTPUT\n                        If using multiple usernames, the output of the results will be\n                        saved to this folder.\n  --output OUTPUT, -o OUTPUT\n                        If using single username, the output of the result will be saved\n                        to this file.\n  --tor, -t             Make requests over Tor; increases runtime; requires Tor to be\n                        installed and in system path.\n  --unique-tor, -u      Make requests over Tor with new Tor circuit after each request;\n                        increases runtime; requires Tor to be installed and in system\n                        path.\n  --csv                 Create Comma-Separated Values (CSV) File.\n  --xlsx                Create the standard file for the modern Microsoft Excel\n                        spreadsheet (xlsx).\n  --site SITE_NAME      Limit analysis to just the listed sites. Add multiple options to\n                        specify more than one site.\n  --proxy PROXY_URL, -p PROXY_URL\n                        Make requests over a proxy. e.g. socks5://127.0.0.1:1080\n  --json JSON_FILE, -j JSON_FILE\n                        Load data from a JSON file or an online, valid, JSON file.\n  --timeout TIMEOUT     Time (in seconds) to wait for response to requests (Default: 60)\n  --print-all           Output sites where the username was not found.\n  --print-found         Output sites where the username was found.\n  --no-color            Don't color terminal output\n  --browse, -b          Browse to all results on default browser.\n  --local, -l           Force the use of the local data.json file.\n  --nsfw                Include checking of NSFW sites from default list.",
      "$ echo '{\"usernames\":[\"user123\"]}' | apify call -so netmilk/sherlock\n[{\n  \"username\": \"user123\",\n  \"links\": [\n    \"https://www.1337x.to/user/user123/\",\n    ...\n  ]\n}]"
    ]
  }
}