{
  "repo": {
    "full_name": "browser-use/browser-use",
    "stars": 71954,
    "forks": 8533,
    "language": "Python",
    "description": "🌐 Make websites accessible for AI agents. Automate tasks online with ease.",
    "topics": [
      "ai-agents",
      "ai-tools",
      "browser-automation",
      "browser-use",
      "llm",
      "playwright",
      "python"
    ],
    "url": "https://github.com/browser-use/browser-use",
    "created_at": "2024-10-31T16:00:56Z",
    "updated_at": "2025-10-31T03:25:53Z"
  },
  "readme_file": "dataset/readmes/browser-use_README.md",
  "task_file": "dataset/tasks/browser-use_tasks.json",
  "num_tasks": 8,
  "num_setup_commands": 0,
  "num_docker_commands": 0,
  "has_docker_files": true,
  "docker_files_list": [
    "Dockerfile",
    ".dockerignore"
  ],
  "docker_setup_descriptions": {
    "Dockerfile": "To build and run the Docker image for the `browser-use` project, follow these steps:\n\n### Purpose of the Image\nThe `browser-use` Docker image is designed to automate web interactions, making websites accessible for AI agents. It bundles essential dependencies including Python 3.12, pip, Playwright, and Chromium, along with the `browser-use` application itself. This setup allows users to run automated tasks in a controlled environment, leveraging the capabilities of a headless browser.\n\n### Building the Docker Image\n1. **Clone the Repository**: Start by cloning the `browser-use` repository from GitHub to your local machine.\n   - Use the command: `git clone https://github.com/browser-use/browser-use.git`\n   - Navigate into the cloned directory: `cd browser-use`\n\n2. **Build the Image**: Execute the Docker build command to create the image.\n   - This command will build the image without using the cache to ensure all dependencies are freshly installed: `docker build . -t browseruse --no-cache`\n   - The build process will install necessary system packages, set up a virtual environment, and install the `browser-use` application along with its dependencies.\n\n### Running the Docker Container\n1. **Run the Container**: After building the image, you can run the container with the following command:\n   - `docker run -v \"$PWD/data\":/data browseruse`\n   - This command mounts a local directory (`data`) to the container, allowing you to persist data generated by the application.\n\n2. **Check the Version**: To verify the installation and check the version of `browser-use`, use:\n   - `docker run -v \"$PWD/data\":/data browseruse --version`\n\n### Multi-Architecture Build (Optional)\nIf you need to support multiple architectures, you can set up a multi-architecture build:\n1. **Create a Buildx Instance**: Use Docker Buildx to create a new build instance.\n   - Command: `docker buildx create --use`\n\n2. **Build for Multiple Platforms**: Build the image for multiple architectures (e.g., `linux/amd64` and `linux/arm64`) and push it to a Docker registry:\n   - Command: `docker buildx build . --platform=linux/amd64,linux/arm64 --push -t browseruse/browseruse:some-tag`\n\n### Additional Resources\nFor more detailed documentation and usage instructions, refer to the official documentation at [https://docs.browser-use.com](https://docs.browser-use.com).",
    ".dockerignore": "To build and run a Docker image using the repository `browser-use/browser-use`, follow these steps:\n\n### Purpose of the Docker Image\nThe Docker image is designed to encapsulate the environment necessary for running the browser-use application. This application likely involves web scraping, data processing, or browser automation, and requires specific dependencies to function correctly. The image ensures that all necessary libraries and tools are included, providing a consistent environment across different systems.\n\n### Building Steps\n1. **Clone the Repository**: Start by cloning the `browser-use` repository to your local machine. This will give you access to the necessary files, including the `.dockerignore` file, which helps optimize the build process by excluding unnecessary files.\n\n2. **Prepare the Docker Environment**: Ensure that Docker is installed and running on your machine. This is crucial for building and running the Docker image.\n\n3. **Create the Docker Image**: Use the Docker CLI to build the image. The build process will read the Dockerfile in the repository, which defines the base image, dependencies, and commands needed to set up the application environment. The `.dockerignore` file will prevent the inclusion of specified files and directories, such as documentation, cache files, virtual environments, and sensitive information, ensuring a cleaner and smaller image.\n\n4. **Dependencies**: The image will include essential dependencies for the application, which may consist of libraries for web scraping (like BeautifulSoup or Scrapy), data manipulation (such as Pandas), and any other tools required for browser automation. These dependencies will be installed during the image build process.\n\n5. **Tagging the Image**: Optionally, tag the image with a meaningful name and version to easily identify it later.\n\n### Running the Docker Image\nOnce the image is built, you can run it using Docker. This will create a container instance of the application, allowing you to execute the browser-use functionalities in an isolated environment.\n\n### Additional Considerations\n- **Environment Variables**: If the application requires any environment variables (e.g., API keys, configuration settings), ensure they are provided at runtime, either through a `.env` file or by passing them directly in the Docker run command.\n- **Volume Mounts**: If the application needs to access data files or output results, consider using Docker volumes to persist data outside the container.\n\nBy following these steps, you will successfully build and run the Docker image for the browser-use application, ensuring a consistent and efficient development and production workflow."
  },
  "processed_at": "2025-10-30T23:33:27.808994"
}