{
  "repo": {
    "full_name": "docling-project/docling",
    "stars": 42697,
    "forks": 3054,
    "language": "Python",
    "description": "Get your documents ready for gen AI",
    "topics": [
      "ai",
      "convert",
      "document-parser",
      "document-parsing",
      "documents",
      "docx",
      "html",
      "markdown",
      "pdf",
      "pdf-converter",
      "pdf-to-json",
      "pdf-to-text",
      "pptx",
      "tables",
      "xlsx"
    ],
    "url": "https://github.com/docling-project/docling",
    "created_at": "2024-07-09T07:50:26Z",
    "updated_at": "2025-10-31T03:37:19Z"
  },
  "readme_file": "dataset/readmes/docling_README.md",
  "task_file": "dataset/tasks/docling_tasks.json",
  "num_tasks": 3,
  "num_setup_commands": 1,
  "num_docker_commands": 0,
  "has_docker_files": true,
  "docker_files_list": [
    "Dockerfile"
  ],
  "docker_setup_descriptions": {
    "Dockerfile": "To build and run the Docker image for the `docling-project/docling` repository, follow these steps:\n\n### Purpose of the Image\nThe Docker image is designed to provide a lightweight environment for running the Docling tool, which is used for managing and processing documentation. This image is based on Python 3.11 and includes essential libraries and dependencies required for running Docling and its associated models.\n\n### Building the Image\n1. **Base Image**: The build process starts with a slim version of Python 3.11, ensuring a minimal footprint while providing the necessary Python environment.\n2. **Environment Configuration**: An environment variable is set to configure SSH for Git operations, allowing for seamless access to repositories without strict host key checking.\n3. **Dependency Installation**: The image installs several system dependencies, including libraries for graphics processing and essential tools like `curl`, `wget`, and `git`. This ensures that the environment can handle various tasks required by Docling.\n4. **Python Package Installation**: The Docling package is installed via pip, specifically configured to use CPU support for PyTorch. This is suitable for environments where GPU resources are not available.\n5. **Model Preparation**: The image includes a step to download necessary model weights using Docling tools, ensuring that the required resources are available for processing.\n6. **Thread Management**: An environment variable is set to limit the number of threads used by the application, preventing potential performance issues in containerized environments.\n\n### Built Image\nThe resulting Docker image is optimized for running Docling with CPU support, equipped with all necessary dependencies and pre-downloaded models. It is ready for immediate use in processing documentation tasks.\n\n### Running the Image\nTo run the Docker container:\n- Use the command to start the container, setting the `DOCLING_ARTIFACTS_PATH` environment variable to specify where to store model weights. This allows the container to utilize the pre-downloaded models effectively.\n- Once inside the container, navigate to the appropriate directory and execute the provided Python script (`minimal.py`) to start using Docling.\n\nThis setup provides a streamlined and efficient way to leverage Docling's capabilities within a Dockerized environment."
  },
  "processed_at": "2025-10-30T23:48:59.056016"
}