{
  "repo": {
    "full_name": "localstack/localstack",
    "stars": 61024,
    "forks": 4279,
    "language": "Python",
    "description": "💻 A fully functional local AWS cloud stack. Develop and test your cloud & Serverless apps offline",
    "topics": [
      "aws",
      "cloud",
      "continuous-integration",
      "developer-tools",
      "localstack",
      "python",
      "testing"
    ],
    "url": "https://github.com/localstack/localstack",
    "created_at": "2016-10-25T23:48:03Z",
    "updated_at": "2025-10-31T02:00:44Z"
  },
  "readme_file": "dataset/readmes/localstack_README.md",
  "task_file": "dataset/tasks/localstack_tasks.json",
  "num_tasks": 3,
  "num_setup_commands": 2,
  "num_docker_commands": 0,
  "has_docker_files": true,
  "docker_files_list": [
    "Dockerfile",
    "docker-compose.yml",
    ".dockerignore"
  ],
  "docker_setup_descriptions": {
    "Dockerfile": "To build and run a Docker image using the `Dockerfile` from the `localstack/localstack` repository, follow these steps:\n\n### Purpose of the Image\nThe Docker image created from this `Dockerfile` is designed to run LocalStack, a fully functional local AWS cloud stack. It allows developers to simulate AWS services locally for testing and development purposes without needing to connect to the actual AWS cloud. The image includes all necessary dependencies and configurations to run LocalStack efficiently.\n\n### Building Steps\n1. **Base Image**: The build process starts with a lightweight Python 3.13.9 base image, which provides the necessary runtime environment. This image is optimized for size and includes essential OS packages.\n\n2. **Install Runtime Dependencies**: The build process installs various runtime dependencies, including tools like `curl`, `git`, and `openssl`, as well as libraries required for the AWS CLI and LocalStack functionality. This ensures that the environment is equipped to handle requests and manage AWS services.\n\n3. **Node.js Installation**: The image installs Node.js from the official distribution, ensuring compatibility with LocalStack's requirements. This step also includes verifying the installation through smoke tests.\n\n4. **User and Directory Setup**: A dedicated user (`localstack`) is created to run the application, and necessary directories are established with appropriate permissions. This enhances security and ensures that LocalStack has the required filesystem structure.\n\n5. **Install Python Packages**: The image installs the AWS CLI and `awslocal`, a command-line tool for interacting with LocalStack, using Python's package manager. This step is crucial for enabling AWS service emulation.\n\n6. **Build Stage**: In a separate build stage, additional build dependencies are installed, and the LocalStack runtime dependencies are set up. This includes creating a virtual environment for Python packages, which isolates the LocalStack installation.\n\n7. **Final Assembly**: The final image is constructed by copying the necessary files and dependencies from the previous stages. This includes the LocalStack core code and any additional scripts needed to start LocalStack.\n\n8. **Health Checks and Configuration**: The image includes health checks to monitor the status of LocalStack services and exposes necessary ports for communication. Environment variables are set for versioning and build metadata.\n\n### Running the Image\nAfter building the image, you can run it using Docker. The container will start LocalStack, allowing you to interact with the simulated AWS services. Ensure to map any required ports and volumes for persistent data storage.\n\n### Dependencies\nThe image relies on several key dependencies:\n- **Python**: For running LocalStack and its associated scripts.\n- **Node.js**: Required for certain LocalStack functionalities.\n- **AWS CLI**: For interacting with AWS services.\n- **Various OS Packages**: Essential for network operations and system interactions.\n\nBy following these steps, you can successfully build and run the LocalStack Docker image, enabling local development and testing of AWS services.",
    "docker-compose.yml": "To build and run Docker using the `docker-compose.yml` file from the `localstack/localstack` repository, follow these steps:\n\n### Purpose of the Image\nThe `localstack/localstack` image is designed to provide a fully functional local AWS cloud stack, enabling developers to simulate AWS services on their local machines. This is particularly useful for testing and development purposes, allowing you to interact with AWS services without incurring costs or requiring internet access.\n\n### Dependencies\nThe image relies on several components:\n- **Docker**: LocalStack utilizes Docker to run various AWS service emulations in isolated containers.\n- **Python**: As LocalStack is built using Python, it requires Python dependencies for its functionality.\n- **AWS SDKs**: LocalStack supports various AWS SDKs for integration, allowing you to interact with the emulated services.\n\n### Building Steps\n1. **Clone the Repository**: Start by cloning the `localstack/localstack` repository to your local machine. This will provide you with access to the `docker-compose.yml` file.\n\n2. **Navigate to the Directory**: Change your working directory to the location where the `docker-compose.yml` file is located.\n\n3. **Configure Environment Variables**: Before building, you may want to configure environment variables such as `LOCALSTACK_DOCKER_NAME`, `DEBUG`, and `LOCALSTACK_VOLUME_DIR` to customize the behavior of LocalStack. These can be set in your shell or included in a `.env` file.\n\n4. **Build the Image**: Use Docker Compose to build the LocalStack image. This process will pull the necessary base images and dependencies, setting up the environment for LocalStack to run.\n\n5. **Run the Container**: Once the image is built, you can start the LocalStack container. The container will expose the LocalStack Gateway on port 4566 and a range of ports (4510-4559) for various AWS services.\n\n6. **Data Persistence**: LocalStack will store its data in a volume mapped to your local directory (as specified in the `docker-compose.yml`), ensuring that your configurations and state persist across restarts.\n\n### Running Commands\nTo run LocalStack, execute the appropriate Docker Compose command to start the services defined in the `docker-compose.yml`. This will initialize the LocalStack environment, allowing you to interact with the emulated AWS services.\n\n### Summary\nBy following these steps, you will successfully build and run the LocalStack Docker image, enabling you to develop and test AWS applications locally without the need for actual AWS resources.",
    ".dockerignore": "To build and run a Docker image using the `.dockerignore` file from the `localstack/localstack` repository, follow these steps:\n\n### Purpose of the Image\nThe Docker image for LocalStack is designed to provide a fully functional local AWS cloud stack for testing and development purposes. It allows developers to simulate AWS services locally, enabling them to build and test applications without incurring costs or needing access to the actual AWS environment. The image typically includes dependencies such as Python, various AWS SDKs, and tools necessary to run and manage the simulated services.\n\n### Building Steps\n1. **Clone the Repository**: Start by cloning the `localstack/localstack` repository to your local machine. This will give you access to the necessary files, including the `.dockerignore` and Dockerfile.\n\n2. **Navigate to the Directory**: Change your working directory to the cloned repository where the Dockerfile is located.\n\n3. **Review the .dockerignore File**: The `.dockerignore` file is crucial as it specifies which files and directories should be excluded from the Docker build context. This helps to reduce the image size and build time by ignoring unnecessary files such as:\n   - Virtual environment directories (e.g., `.venv*`)\n   - Temporary files and directories (e.g., `target/`, `htmlcov/`)\n   - CI-generated files (e.g., `tests/aws/**/node_modules`, `tests/aws/**/.terraform`)\n   - Python cache files (e.g., `**/__pycache__`)\n\n4. **Build the Image**: Use the Docker build command to create the image. This process will read the Dockerfile and build the image according to the specified instructions, while respecting the exclusions defined in the `.dockerignore` file. The build process may take some time as it pulls the necessary base images and installs the required dependencies.\n\n5. **Run the Image**: After successfully building the image, you can run it using Docker. This will start a container based on the image, allowing you to interact with the LocalStack services. Ensure that you configure the container with the appropriate environment variables and port mappings to access the simulated AWS services.\n\n### Summary\nBy following these steps, you will have a Docker image that encapsulates the LocalStack environment, ready for local development and testing of AWS applications. The use of the `.dockerignore` file ensures that your image remains lightweight and free from unnecessary files, optimizing both build time and performance."
  },
  "processed_at": "2025-10-30T23:38:01.205241"
}