{
  "repo": {
    "full_name": "microsoft/markitdown",
    "stars": 82292,
    "forks": 4629,
    "language": "Python",
    "description": "Python tool for converting files and office documents to Markdown.",
    "topics": [
      "autogen",
      "autogen-extension",
      "langchain",
      "markdown",
      "microsoft-office",
      "openai",
      "pdf"
    ],
    "url": "https://github.com/microsoft/markitdown",
    "created_at": "2024-11-13T19:56:40Z",
    "updated_at": "2025-10-31T03:19:16Z"
  },
  "readme_file": "dataset/readmes/markitdown_README.md",
  "task_file": "dataset/tasks/markitdown_tasks.json",
  "num_tasks": 9,
  "num_setup_commands": 6,
  "num_docker_commands": 1,
  "has_docker_files": true,
  "docker_files_list": [
    "Dockerfile",
    ".dockerignore"
  ],
  "docker_setup_descriptions": {
    "Dockerfile": "To build and run the Docker image for the Markitdown project from the Microsoft repository, follow these steps:\n\n### Building the Docker Image\n\n1. **Prepare Your Environment**: Ensure you have Docker installed and running on your machine.\n\n2. **Clone the Repository**: Download the `microsoft/markitdown` repository to your local machine. This repository contains the necessary files, including the Dockerfile.\n\n3. **Navigate to the Directory**: Open a terminal and change to the directory where the Dockerfile is located.\n\n4. **Build the Image**: Execute the Docker build command. This process will create an image named `markitdown:latest`. The image is based on a slim version of Python 3.13 and includes essential runtime dependencies such as `ffmpeg` and `exiftool`, which are used for processing multimedia files and metadata, respectively. The build process also installs the Markitdown package along with a sample plugin.\n\n### Running the Docker Container\n\n1. **Run the Container**: After successfully building the image, you can run it using the Docker run command. This command will execute the Markitdown tool, which converts PDF files into Markdown format.\n\n2. **Input and Output**: When running the container, you will need to specify the input PDF file (e.g., `~/your-file.pdf`) and redirect the output to a Markdown file (e.g., `output.md`). The container will process the PDF and generate the corresponding Markdown content.\n\n### Summary of the Image Purpose and Dependencies\n\nThe Docker image serves the purpose of providing a lightweight environment to convert PDF documents into Markdown format using the Markitdown tool. It includes:\n\n- **Python 3.13**: The programming language used for the Markitdown application.\n- **FFmpeg**: A multimedia framework for handling video, audio, and other multimedia files and streams.\n- **ExifTool**: A tool for reading, writing, and editing metadata in files.\n\nBy following these steps, you will be able to build and run the Markitdown Docker image effectively.",
    ".dockerignore": "To build and run the Docker image for the Microsoft Markitdown project, follow these steps:\n\n### Building the Docker Image\n\n1. **Setup Your Environment**: Ensure you have Docker installed on your machine. You can verify this by running `docker --version` in your terminal.\n\n2. **Clone the Repository**: Download the `microsoft/markitdown` repository to your local machine. This repository contains the necessary files for building the Docker image.\n\n3. **Create the .dockerignore File**: The `.dockerignore` file is crucial as it specifies which files and directories should be excluded from the Docker build context. In this case, it includes all files and directories except for the `packages/` directory. This helps to reduce the build context size and speeds up the build process by ignoring unnecessary files.\n\n4. **Build the Image**: Navigate to the root directory of the cloned repository where the Dockerfile is located. Use the Docker build command to create the image. The image is designed to convert Markdown files into PDF format, leveraging the dependencies specified in the Dockerfile. These dependencies typically include tools for processing Markdown and generating PDFs, ensuring that the image has everything needed to perform the conversion.\n\n5. **Tag the Image**: During the build process, tag the image as `markitdown:latest` to easily reference it later.\n\n### Running the Docker Image\n\n1. **Run the Container**: After successfully building the image, you can run it to convert a Markdown file to PDF. Use the Docker run command, which allows you to execute the container interactively. The command takes your Markdown file as input and outputs the converted content in Markdown format to a specified output file.\n\n2. **Input and Output**: Make sure to provide the path to your Markdown file when running the container. The output will be directed to a file named `output.md`, which will contain the converted content.\n\n### Summary\n\nThe Docker image built from the Microsoft Markitdown repository is designed to facilitate the conversion of Markdown documents into PDF format. It relies on specific dependencies that are included in the build process, ensuring that all necessary tools are available within the container. By following the outlined steps, you can efficiently build and run the Docker image to convert your Markdown files."
  },
  "processed_at": "2025-10-30T23:32:02.960848"
}