{
  "repo": {
    "full_name": "OpenHands/OpenHands",
    "stars": 64584,
    "forks": 7840,
    "language": "Python",
    "description": "🙌 OpenHands: Code Less, Make More",
    "topics": [
      "agent",
      "artificial-intelligence",
      "chatgpt",
      "claude-ai",
      "cli",
      "developer-tools",
      "gpt",
      "llm",
      "openai"
    ],
    "url": "https://github.com/OpenHands/OpenHands",
    "created_at": "2024-03-13T03:33:31Z",
    "updated_at": "2025-10-31T03:07:31Z"
  },
  "readme_file": "dataset/readmes/OpenHands_README.md",
  "task_file": "dataset/tasks/OpenHands_tasks.json",
  "num_tasks": 2,
  "num_setup_commands": 0,
  "num_docker_commands": 1,
  "has_docker_files": true,
  "docker_files_list": [
    "docker-compose.yml",
    ".dockerignore"
  ],
  "docker_setup_descriptions": {
    "docker-compose.yml": "To build and run the Docker application using the `docker-compose.yml` file from the OpenHands/OpenHands repository, follow these steps:\n\n### Purpose of the Image\nThe Docker image `openhands:latest` is designed to facilitate the development and execution of the OpenHands application. It encapsulates all necessary dependencies, including the runtime environment and libraries required for the application to function seamlessly. This image is tailored for use in a sandboxed environment, allowing developers to work on the OpenHands project without affecting their local setup.\n\n### Building the Image\n1. **Clone the Repository**: Start by cloning the OpenHands repository to your local machine. This will provide you with access to the `docker-compose.yml` file and the associated Dockerfile.\n\n2. **Navigate to the Directory**: Change your working directory to the location of the `docker-compose.yml` file. This file defines the services, networks, and volumes needed for the application.\n\n3. **Build the Docker Image**: Use Docker Compose to build the image. This process will read the `docker-compose.yml` file and execute the build instructions specified for the `openhands` service. During this step, Docker will create a new image based on the configurations defined in the Dockerfile located in the `./containers/app/` directory. The build process will resolve dependencies, set up the environment, and prepare the application for execution.\n\n### Running the Application\n1. **Set Environment Variables**: Before running the container, ensure that any necessary environment variables are set. For instance, you may want to specify the `SANDBOX_RUNTIME_CONTAINER_IMAGE` to point to the appropriate runtime version. You can also define the `WORKSPACE_BASE` variable to specify where your workspace will be mounted.\n\n2. **Start the Container**: Utilize Docker Compose to start the application. This will create and run the `openhands` container with the configurations specified in the `docker-compose.yml` file. The container will expose port 3000, allowing you to access the application through your browser or API client.\n\n3. **Volume Mounting**: The setup includes volume mounts for the Docker socket and your local OpenHands configuration directory. This allows the container to interact with the Docker daemon on your host and persist user-specific configurations.\n\n4. **Accessing the Application**: Once the container is running, you can access the OpenHands application at `http://localhost:3000`. Ensure that your local environment is configured to allow connections to this port.\n\n### Additional Notes\n- If you require a specific non-root user within the container, you can uncomment the `SANDBOX_USER_ID` variable in the environment section and adjust permissions accordingly.\n- The container is set to run in interactive mode, allowing you to interact with it via the terminal if needed.\n\nBy following these steps, you will successfully build and run the OpenHands application using Docker, enabling a streamlined development experience.",
    ".dockerignore": "To build and run the Docker image for the OpenHands project, follow these steps:\n\n### Purpose of the Docker Image\nThe Docker image for OpenHands is designed to provide a consistent and isolated environment for running the OpenHands application. This application is likely a web-based platform that requires specific dependencies and configurations to function correctly. The image encapsulates all necessary components, ensuring that the application runs smoothly across different environments.\n\n### Building Steps\n1. **Prepare Your Environment**: Ensure you have Docker installed on your machine. You can verify this by running `docker --version` in your terminal.\n\n2. **Clone the Repository**: Start by cloning the OpenHands repository from GitHub to your local machine. This will give you access to the necessary files, including the `.dockerignore` file, which helps optimize the build process by excluding unnecessary files.\n\n3. **Review the .dockerignore File**: The `.dockerignore` file specifies which files and directories should be excluded from the Docker build context. This includes:\n   - Node.js dependencies located in `frontend/node_modules`, which are not needed for the build.\n   - Configuration files (except `pyproject.toml`) and documentation files (except `README.md`), which are not required for the runtime environment.\n   - Hidden files, cache directories, and unneeded directories such as `/dev_config/`, `/docs/`, `/evaluation/`, and `/tests/`.\n\n4. **Build the Docker Image**: Use the appropriate Docker command to build the image. This command will read the Dockerfile in the repository and create an image that includes all necessary dependencies, such as Node.js and any other libraries specified in the Dockerfile.\n\n5. **Verify the Image**: After the build completes, you can list your Docker images using `docker images` to ensure that the OpenHands image has been created successfully.\n\n### Running the Docker Image\n1. **Run the Container**: To run the OpenHands application, use the provided Docker run command. This command sets up the environment variables necessary for the application, mounts the Docker socket for container management, and maps the local directory for persistent storage.\n\n2. **Access the Application**: Once the container is running, you can access the OpenHands application by navigating to `http://localhost:3000` in your web browser. The application should be fully operational, leveraging the isolated environment provided by Docker.\n\nBy following these steps, you will have successfully built and run the OpenHands Docker image, allowing you to utilize the application in a controlled and efficient manner."
  },
  "processed_at": "2025-10-30T23:35:41.370459"
}