{
  "repo": {
    "full_name": "openinterpreter/open-interpreter",
    "stars": 60743,
    "forks": 5211,
    "language": "Python",
    "description": "A natural language interface for computers",
    "topics": [
      "chatgpt",
      "gpt-4",
      "interpreter",
      "javascript",
      "nodejs",
      "python"
    ],
    "url": "https://github.com/openinterpreter/open-interpreter",
    "created_at": "2023-07-14T07:10:44Z",
    "updated_at": "2025-10-31T03:30:43Z"
  },
  "readme_file": "dataset/readmes/open-interpreter_README.md",
  "task_file": "dataset/tasks/open-interpreter_tasks.json",
  "num_tasks": 11,
  "num_setup_commands": 3,
  "num_docker_commands": 0,
  "has_docker_files": true,
  "docker_files_list": [
    "Dockerfile"
  ],
  "docker_setup_descriptions": {
    "Dockerfile": "To build and run the Docker image for the openinterpreter/open-interpreter repository, follow these steps:\n\n### Building the Docker Image\n\n1. **Set Up Your Environment**: Ensure you have Docker installed on your machine. You can download it from the official Docker website.\n\n2. **Clone the Repository**: Use Git to clone the openinterpreter/open-interpreter repository to your local machine. This will give you access to the Dockerfile and necessary files.\n\n3. **Navigate to the Directory**: Open a terminal and change to the directory where the Dockerfile is located.\n\n4. **Build the Image**: Execute the Docker build command. This process will:\n   - Use the official Python 3.11.8 image as the base, ensuring you have a compatible environment for running Python applications.\n   - Set environment variables, including the server host to `0.0.0.0`, allowing the server to be accessible from outside the container.\n   - Create necessary directories and copy required files (such as the interpreter code, scripts, and dependency files) into the container.\n   - Install the server dependencies specified in the `pyproject.toml` and `poetry.lock` files, ensuring all necessary libraries and packages are available for the application to run.\n   - Expose port 8000, which is the designated port for the websocket server.\n\n### Running the Docker Container\n\n1. **Run the Container**: After successfully building the image, you can run the container. This will start the LMC-compatible websocket server, which listens on port 8000.\n\n2. **Access the Server**: Once the container is running, you can access the websocket server from your browser or any websocket client by connecting to `http://<your-docker-host>:8000`.\n\n### Purpose of the Image\n\nThe purpose of this Docker image is to provide a lightweight, isolated environment for running an LMC-compatible websocket server. This server facilitates communication based on the LMC protocol, allowing for real-time interactions and data exchanges. The image includes all necessary dependencies to ensure the server operates correctly and efficiently.\n\nBy following these steps, you will have a fully functional Docker container running the websocket server from the openinterpreter/open-interpreter repository."
  },
  "processed_at": "2025-10-30T23:38:31.254119"
}